<html>
<head>
</head>
<body>
<form method="POST">
    <input type="text" name="day">
    <input type="submit">
</form>
</body>
</html>
<?php
$day = $_POST['day'];
if (!empty($day)){
if ($day > 0 && $day <= 31) {
    echo '<br>'. "Метод if:".'<br>';
    if ($day > 0 && $day <= 10) {
        echo "Первая Декада";
    }elseif ($day > 10 && $day <= 20){
        echo "Вторая Декада";
    }elseif ($day > 20 && $day<= 31){
        echo "Третья Декада";
    }
echo '<br>'. "Метод switch:".'<br>';
switch ($day){
    case $day >=1 && $day<= 10:
        echo "Первая Декада";
        break;
    case $day > 10 && $day<=20:
        echo "Вторая Декада";
        break;
    case $day > 20 && $day<=31:
        echo "Третья Декада";
        break;
}
echo '<br>'. "Попробуем Масивом:".'<br>';
$array = [
        "1" =>"Первая Декада",  "11" =>"Вторая Декада",  "21" =>"Третья Декада",
        "2" =>"Первая Декада",  "12" =>"Вторая Декада",  "22" =>"Третья Декада",
        "3" =>"Первая Декада",  "13" =>"Вторая Декада",  "23" =>"Третья Декада",
        "4" =>"Первая Декада",  "14" =>"Вторая Декада",  "24" =>"Третья Декада",
        "5" =>"Первая Декада",  "15" =>"Вторая Декада",  "25" =>"Третья Декада",
        "6" =>"Первая Декада",  "16" =>"Вторая Декада",  "26" =>"Третья Декада",
        "7" =>"Первая Декада",  "17" =>"Вторая Декада",  "27" =>"Третья Декада",
        "8" =>"Первая Декада",  "18" =>"Вторая Декада",  "28" =>"Третья Декада",
        "9" =>"Первая Декада",  "19" =>"Вторая Декада",  "29" =>"Третья Декада",
        "10" =>"Первая Декада", "20" =>"Вторая Декада",  "30" =>"Третья Декада",
                                                         "31" =>"Третья Декада",
];
echo $array[$day];
} else {
    echo " Введите число от 1 до 31";
}
}else {
    echo "Принимаем значения от 1 до 31";
}